Repository: taikun114/Mocolamma
Catalog: Mocolamma/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, ru, uk, zh_hans, zh_hk

source: Specifies the seed value used for text generation.
ar: يحدد قيمة البذرة المستخدمة لتوليد النص.
de: Gibt den Seed-Wert an, der für die Texterzeugung verwendet wird.
es: Especifica el valor de la semilla utilizado para la generación de texto.
fr: Spécifie la valeur de graine utilisée pour la génération de texte.
ja: テキスト生成に使用するシード値を指定します。
ko: 텍스트 생성에 사용할 시드 값을 지정합니다.
ru: Указывает сид (начальное значение), используемый для генерации текста.
uk: Вказує сид (початкове значення), що використовується для генерації тексту.
zh_hans: 指定用于文本生成的种子值。
zh_hk: 指定用於文字生成的種子值。

source: Specifies the width of the image you want to generate.
ar: يحدد عرض الصورة التي تريد توليدها.
de: Gibt die Breite des Bildes an, das Sie erzeugen möchten.
es: Especifica el ancho de la imagen que deseas generar.
fr: Spécifie la largeur de l'image que vous souhaitez générer.
ja: 生成したい画像の幅を指定します。
ko: 생성할 이미지의 너비를 지정합니다.
ru: Указывает ширину изображения, которое вы хотите сгенерировать.
uk: Вказує ширину зображення, яке ви хочете згенерувати.
zh_hans: 指定您要生成的图像宽度。
zh_hk: 指定您要生成的圖片寬度。

source: Specifies whether to perform inference when using a reasoning model.
ar: يحدد ما إذا كان سيتم إجراء الاستدلال عند استخدام نموذج تفكير.
de: Gibt an, ob bei der Verwendung eines Denkmodells Inferenzen durchgeführt werden sollen.
es: Especifica si se debe realizar la inferencia al usar un modelo de razonamiento.
fr: Spécifie s'il faut effectuer une inférence lors de l'utilisation d'un modèle de raisonnement.
ja: 一部の推論モデルを使う場合に推論を行うかどうかを指定します。
ko: 추론 모델을 사용할 때 추론(Reasoning)을 수행할지 여부를 지정합니다.
ru: Указывает, следует ли выполнять рассуждение при использовании модели рассуждения.
uk: Вказує, чи слід виконувати міркування при використанні моделі міркування.
zh_hans: 指定在使用推理模型时是否进行推理。
zh_hk: 指定在使用推理模型時是否進行推理。

source: Specify how long the model will stay loaded into memory. Models can be unloaded at any time.
ar: حدد المدة التي سيبقى فيها النموذج محملاً في الذاكرة. يمكن إلغاء تحميل النموذج في أي وقت.
de: Legen Sie fest, wie lange das Modell im Speicher geladen bleibt. Modelle können jederzeit entladen werden.
es: Especifique cuánto tiempo permanecerá cargado el modelo en memoria. Los modelos se pueden descargar en cualquier momento.
fr: Spécifiez la durée pendant laquelle le modèle restera chargé en mémoire. Les modèles peuvent être déchargés à tout moment.
ja: モデルをサーバー上に保持する時間を指定します。モデルはいつでもアンロードできます。
ko: 모델이 메모리에 로드된 상태로 유지될 시간을 지정합니다. 모델은 언제든지 언로드할 수 있습니다.
ru: Укажите, как долго модель будет оставаться загруженной в память. Модели можно выгрузить в любое время.
uk: Вкажіть, як довго модель залишатиметься завантаженою в пам'яті. Моделі можна вивантажити в будь-який час.
zh_hans: 指定模型在内存中保留的时间。可以随时卸载模型。
zh_hk: 指定模型在記憶體中保留的時間。可以隨時卸載模型。

source: Status
ar: الحالة
es: Estado
fr: État
ja: ステータス
ko: 상태
ru: Статус
uk: Статус
zh_hans: 状态
zh_hk: 狀態

source: Steps
ar: الخطوات
de: Schritte
es: Pasos
fr: Étapes
ja: ステップ数
ko: 단계
ru: Шаги
uk: Кроки
zh_hans: 步数
zh_hk: 步數

source: Stopped
ar: متوقف
de: Gestoppt
es: Detenido
fr: Arrêté
ja: 停止済み
ko: 중지됨
ru: Остановлено
uk: Зупинено
zh_hans: 已停止
zh_hk: 已停止

source: Stream Response
ar: استجابة متدفقة
de: Stream-Antwort
es: Respuesta en Streaming
fr: Réponse en streaming
ja: ストリームレスポンス
ko: 스트림 응답
ru: Потоковый ответ
uk: Потокова відповідь
zh_hans: 流式响应
zh_hk: 串流回應

# Successfully deleted model '%@' from %@.
source: Successfully deleted model '%1$@' from %2$@.
ar: تم حذف النموذج "%1$@" من %2$@ بنجاح.
de: Modell '%1$@' erfolgreich von %2$@ gelöscht.
es: Se eliminó con éxito el modelo '%1$@' de %2$@.
fr: Le modèle '%1$@' a été supprimé avec succès de %2$@.
ja: モデル「%1$@」を「%2$@」からの削除に成功しました。
ko: %2$@에서 모델 '%1$@'을(를) 삭제했습니다.
ru: Модель "%1$@" успешно удалена с %2$@.
uk: Модель "%1$@" успішно видалена з %2$@.
zh_hans: 已成功从 %2$@ 删除模型“%1$@”。
zh_hk: 已成功從 %2$@ 刪除模型「%1$@」。

source: Successfully fetched models from demo server. Total: %d
ar: تم جلب النماذج من الخادم التجريبي بنجاح. المجموع: %d
de: Modelle erfolgreich vom Demo-Server abgerufen. Insgesamt: %d
es: Modelos obtenidos exitosamente del servidor de demostración. Total: %d
fr: Modèles récupérés avec succès depuis le serveur de démonstration. Total : %d
ja: デモサーバーからモデルを正常に取得しました。合計: %d
ko: 데모 서버에서 모델을 성공적으로 가져왔습니다. 합계: %d
ru: Модели успешно получены с демо-сервера. Всего: %d
uk: Моделі успішно отримані з демо-сервера. Всього: %d
zh_hans: 已成功从演示服务器获取模型。总数：%d
zh_hk: 已成功從演示伺服器取得模型。總數：%d

source: Successfully fetched models. Total: %d
ar: تم جلب النماذج بنجاح. المجموع: %d
de: Modelle erfolgreich abgerufen. Gesamt: %d
es: Modelos obtenidos con éxito. Total: %d
fr: Modèles récupérés avec succès. Total : %d
ja: モデルの取得に成功しました。合計: %d
ko: 모델을 성공적으로 가져왔습니다. 합계: %d
ru: Модели успешно получены. Всего: %d
uk: Моделі успішно отримані. Всього: %d
zh_hans: 已成功获取模型。总数：%d
zh_hk: 已成功取得模型。總數：%d

source: Support and Feedback
ar: الدعم والملاحظات
de: Support und Feedback
es: Soporte y Comentarios
fr: Support et commentaires
ja: サポートとフィードバック
ko: 지원 및 피드백
ru: Поддержка и отзывы
uk: Підтримка та відгуки
zh_hans: 支持与反馈
zh_hk: 支援與回饋

source: Support Developer
ar: دعم المطور
de: Entwickler unterstützen
es: Apoyar al Desarrollador
fr: Soutenir le développeur
ja: 開発者をサポート
ko: 개발자 후원
ru: Поддержать разработчика
uk: Підтримати розробника
zh_hans: 支持开发者
zh_hk: 支持開發者

source: System Prompt
ar: مطالبة النظام
es: Prompt del Sistema
fr: Invite système
ja: システムプロンプト
ko: 시스템 프롬프트
ru: Системный запрос
uk: Системний запит
zh_hans: 系统提示词
zh_hk: 系統提示詞

source: Temperature
ar: الحرارة (Temperature)
de: Temperatur
es: Temperatura
fr: Température
ja: 温度
ko: 온도
ru: Температура
uk: Температура
zh_hans: 温度
zh_hk: 溫度

source: The selected model "%@" does not support image recognition, so images will not be sent. Are you sure you want to send it as is?
ar: النموذج المختار "%@" لا يدعم التعرف على الصور، لذا لن يتم إرسال الصور. هل أنت متأكد من أنك تريد الإرسال كما هو؟
de: Das ausgewählte Modell "%@" unterstützt keine Bilderkennung, daher werden keine Bilder gesendet. Sind Sie sicher, dass Sie es so senden möchten?
es: El modelo seleccionado "%@" no admite el reconocimiento de imágenes, por lo que no se enviarán imágenes. ¿Está seguro de que desea enviarlo tal cual?
fr: Le modèle sélectionné « %@ » ne prend pas en charge la reconnaissance d'images, les images ne seront donc pas envoyées. Êtes-vous sûr de vouloir l'envoyer tel quel ?
ja: 選択されたモデル「%@」は画像認識に対応していないため、画像は送信されません。このまま送信してもよろしいですか？
ko: 선택된 모델 "%@"은(는) 이미지 인식을 지원하지 않으므로 이미지가 전송되지 않습니다. 이대로 전송하시겠습니까?
ru: Выбранная модель «%@» не поддерживает распознавание изображений, поэтому изображения не будут отправлены. Вы уверены, что хотите отправить как есть?
uk: Вибрана модель «%@» не підтримує розпізнавання зображень, тому зображення не будуть надіслані. Ви впевнені, що хочете надіслати як є?
zh_hans: 所选模型“%@”不支持图像识别，因此不会发送图像。您確定要按原样发送吗？
zh_hk: 所選模型「%@」不支援圖像識別，因此不會發送圖像。您確定要按原樣發送嗎？

source: The selected model does not support image recognition, so images will not be sent. Are you sure you want to send it as is?
ar: النموذج المختار لا يدعم التعرف على الصور، لذا لن يتم إرسال الصور. هل أنت متأكد من أنك تريد الإرسال كما هو؟
de: Das ausgewählte Modell unterstützt keine Bilderkennung, daher werden keine Bilder gesendet. Sind Sie sicher, dass Sie es so senden möchten?
es: El modelo seleccionado no admite el reconocimiento de imágenes, por lo que no se enviarán imágenes. ¿Está seguro de que desea enviarlo tal cual?
fr: Le modèle sélectionné ne prend pas en charge la reconnaissance d'images, les images ne seront donc pas envoyées. Êtes-vous sûr de vouloir l'envoyer tel quel ?
ja: 選択されたモデルは画像認識に対応していないため、画像は送信されません。このまま送信してもよろしいですか？
ko: 선택된 모델은 이미지 인식을 지원하지 않으므로 이미지가 전송되지 않습니다. 이대로 전송하시겠습니까?
ru: Выбранная модель не поддерживает распознавание изображений, поэтому изображения не будут отправлены. Вы уверены, что хотите отправить как есть?
uk: Вибрана модель не підтримує розпізнавання зображень, тому зображення не будуть надіслані. Ви впевнені, що хочете надіслати як є?
zh_hans: 所选模型不支持图像识别，因此不会发送图像。您確定要按原样发送吗？
zh_hk: 所選模型不支援圖像識別，因此不會發送圖像。您確定要按原樣發送嗎？

source: Thinking
ar: تفكير
de: Denken
es: Pensamiento
fr: Réflexion
ja: 思考
ko: 추론(Thinking)
ru: Рассуждение
uk: Міркування
zh_hans: 思考
zh_hk: 思考

source: Thinking completed
ar: اكتمل التفكير
de: Denken abgeschlossen
es: Pensamiento completado
fr: Réflexion terminée
ja: 思考完了
ko: 추론 완료
ru: Рассуждение завершено
uk: Міркування завершено
zh_hans: 思考完成
zh_hk: 思考完成

source: Thinking...
ar: جاري التفكير...
de: Denken...
es: Pensando...
fr: Réflexion en cours...
ja: 思考中...
ko: 추론 중...
ru: Рассуждение...
uk: Міркування...
zh_hans: 思考中...
zh_hk: 思考中...

# ThinkingOption_None
source: None
ar: غير محدد
de: Keine
es: Ninguno
fr: Aucun
ja: 指定なし
ko: 지정 안 함
ru: Не указано
uk: Не вказано
zh_hans: 未指定
zh_hk: 未指定

# ThinkingOption_Off
source: Off
ar: إيقاف
de: Aus
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
ru: Выкл
uk: Вимк
zh_hans: 关闭
zh_hk: 關閉

# ThinkingOption_On
source: On
ar: تشغيل
de: An
es: Activado
fr: Activé
ja: オン
ko: 켜기
ru: Вкл
uk: Увімк
zh_hans: 开启
zh_hk: 開啟

source: This model cannot be used
ar: لا يمكن استخدام هذا النموذج
de: Dieses Modell kann nicht verwendet werden
es: Este modelo no se puede utilizar
fr: Ce modèle ne peut pas être utilisé
ja: このモデルは使用できません
ko: 이 모델은 사용할 수 없습니다
ru: Эту модель нельзя использовать
uk: Цю модель неможливо використовувати
zh_hans: 此模型无法使用
zh_hk: 此模型無法使用

source: This model does not support chat.
ar: هذا النموذج لا يدعم الدردشة.
de: Dieses Modell unterstützt keinen Chat.
es: Este modelo no es compatible con el chat.
fr: Ce modèle ne prend pas en charge le chat.
ja: このモデルはチャットに対応していません。
ko: 이 모델은 채팅을 지원하지 않습니다.
ru: Эта модель не поддерживает чат.
uk: Ця модель не підтримує чат.
zh_hans: 此模型不支持聊天。
zh_hk: 此模型不支援聊天。

source: This model does not support images
ar: هذا النموذج لا يدعم الصور
de: Dieses Modell unterstützt keine Bilder
es: Este modelo no admite imágenes
fr: Ce modèle ne prend pas en charge les images
ja: このモデルは画像に対応していません
ko: 이 모델은 이미지를 지원하지 않습니다
ru: Эта модель не поддерживает изображения
uk: Ця модель не підтримує зображення
zh_hans: 此模型不支持图像
zh_hk: 此模型不支援圖像

source: TLS error occurred. Could not establish a secure connection.
ar: حدث خطأ في TLS. تعذر إنشاء اتصال آمن.
de: TLS-Fehler aufgetreten. Es konnte keine sichere Verbindung hergestellt werden.
es: Ocurrió un error TLS. No se pudo establecer una conexión segura.
fr: Une erreur TLS s'est produite. Impossible d'établir une connexion sécurisée.
ja: TLSエラーが発生しました。安全な接続を確立できませんでした。
ko: TLS 오류가 발생했습니다. 보안 연결을 설정할 수 없습니다.
ru: Произошла ошибка TLS. Не удалось установить безопасное соединение.
uk: Сталася помилка TLS. Не вдалося встановити безпечне з'єднання.
zh_hans: 发生 TLS 错误。无法建立安全连接。
zh_hk: 發生 TLS 錯誤。無法建立安全連線。

source: To allow local network access, go to Settings → Privacy & Security → Local Network, and toggle "Mocolamma" on.
ar: للسماح بالوصول إلى الشبكة المحلية، انتقل إلى الإعدادات ← الخصوصية والأمان ← الشبكة المحلية، وقم بتشغيل "Mocolamma".
de: Um den lokalen Netzwerkzugriff zu erlauben, gehen Sie zu Einstellungen → Datenschutz & Sicherheit → Lokales Netzwerk und aktivieren Sie "Mocolamma".
es: Para permitir el acceso a la red local, ve a Ajustes → Privacidad y seguridad → Red local, y activa "Mocolamma" on.
fr: Pour autoriser l'accès au réseau local, allez dans Réglages → Confidentialité et sécurité → Réseau local, puis activez "Mocolamma" on.
ja: ローカルネットワークアクセスを許可するには、「設定」→「プライバシーとセキュリティ」→「ローカルネットワーク」と進み、「Mocolamma」をオンにします。
ko: 로컬 네트워크 액세스를 허용하려면 설정 → 개인정보 보호 및 보안 → 로컬 네트워크로 이동하여 "Mocolamma"를 켜세요.
ru: Чтобы разрешить доступ к локальной сети, перейдите в «Настройки» → «Конфиденциальность и безопасность» → «Локальная сеть» и включите «Mocolamma».
uk: Щоб дозволити доступ до локальної мережі, перейдіть у «Налаштування» → «Конфіденційність та безпека» → «Локальна мережа» та увімкніть «Mocolamma».
zh_hans: 要允许本地网络访问，请前往“设置”→“隐私与安全”→“本地网络”，然后开启“Mocolamma”。
zh_hk: 要允許區域網絡存取，請前往「設定」→「隱私權與安全性」→「區域網絡」，然後開啟「Mocolamma」。

source: To allow local network access, go to System Settings → Privacy & Security → Local Network, and toggle "Mocolamma" on. Click or tap "OK" to open Privacy & Security settings.
ar: للسماح بالوصول إلى الشبكة المحلية، انتقل إلى إعدادات النظام ← الخصوصية والأمان ← الشبكة المحلية، وقم بتشغيل "Mocolamma". انقر أو اضغط على "موافق" لفتح إعدادات الخصوصية والأمان.
de: Um den lokalen Netzwerkzugriff zu erlauben, gehen Sie zu Systemeinstellungen → Datenschutz & Sicherheit → Lokales Netzwerk und aktivieren Sie "Mocolamma". Klicken oder tippen Sie auf "OK", um die Datenschutz- & Sicherheitseinstellungen zu öffnen.
es: Para permitir el acceso a la red local, ve a Ajustes del Sistema → Privacidad y seguridad → Red local, y activa "Mocolamma" on. Haz clic o pulsa "OK" para abrir los ajustes de Privacidad y seguridad.
fr: Pour autoriser l'accès au réseau local, allez dans Paramètres système → Confidentialité et sécurité → Réseau local, puis activez "Mocolamma" on. Cliquez ou appuyez sur "OK" pour ouvrir les paramètres de confidentialité et de sécurité.
ja: ローカルネットワークアクセスを許可するには、「システム設定」→「プライバシーとセキュリティ」→「ローカルネットワーク」と進み、「Mocolamma」をオンにします。 「OK」をクリックまたはタップすると「プライバシーとセキュリティ」設定を開きます。
ko: 로컬 네트워크 액세스를 허용하려면 시스템 설정 → 개인정보 보호 및 보안 → 로컬 네트워크로 이동하여 "Mocolamma"를 켜세요. "확인"을 클릭하거나 탭하여 개인정보 보호 및 보안 설정을 엽니다.
ru: Чтобы разрешить доступ к локальной сети, перейдите в «Системные настройки» → «Конфиденциальность и безопасность» → «Локальная сеть» и включите «Mocolamma». Нажмите «ОК», чтобы открыть настройки конфиденциальности и безопасности.
uk: Щоб дозволити доступ до локальної мережі, перейдіть у «Системні налаштування» → «Конфіденційність та безпека» → «Локальна мережа» та увімкніть «Mocolamma». Натисніть «ОК», щоб відкрити налаштування конфіденційності та безпеки.
zh_hans: 要允许本地网络访问，请前往“系统设置”→“隐私与安全”→“本地网络”，然后开启“Mocolamma”。 点击“确定”以打开“隐私与安全”设置。
zh_hk: 要允許區域網絡存取，請前往「系統設定」→「隱私權與安全性」→「區域網絡」，然後開啟「Mocolamma」。 按一下「確定」以開啟「隱私權與安全性」設定。

source: Toggle Inspector
ar: تبديل المفتش
de: Inspektor umschalten
es: Alternar Inspector
fr: Basculer l'inspecteur
ja: インスペクタを切り替える
ko: 인스펙터 전환
ru: Переключить инспектор
uk: Переключити інспектор
zh_hans: 切换检查器
zh_hk: 切換檢查器

source: Toggle Text Wrapping
ar: تبديل التفاف النص
de: Textumbruch umschalten
es: Alternar Ajuste de Texto
fr: Activer/Désactiver le retour à la ligne
ja: テキストの折り返しを切り替える
ko: 텍스트 줄 바꿈 전환
ru: Переключить перенос текста
uk: Переключити перенос текста
zh_hans: 切换文本换行
zh_hk: 切換自動換行

source: Tools
ar: أدوات
es: Herramientas
fr: Outils
ja: ツール
ko: 도구
ru: Инструменты
uk: Інструменти
zh_hans: 工具
zh_hk: 工具

source: Type your message...
ar: اكتب رسالتك...
de: Geben Sie Ihre Nachricht ein...
es: Escribe tu mensaje...
fr: Saisissez votre message...
ja: メッセージを入力…
ko: 메시지를 입력하세요…
ru: Введите сообщение...
uk: Введіть повідомлення...
zh_hans: 输入您的消息…
zh_hk: 輸入您的訊息…

source: Unit
ar: الوحدة
de: Einheit
es: Unidad
fr: Unité
ja: 単位
ko: 단위
ru: Единица
uk: Одиниця
zh_hans: 单位
zh_hk: 單位

source: Unlimited
ar: غير محدود
de: Unbegrenzt
es: Ilimitado
fr: Illimité
ja: 無制限
ko: 무제한
ru: Без ограничений
uk: Без обмежень
zh_hans: 无限制
zh_hk: 無限制

source: Unload
ar: تفريغ
de: Entladen
es: Descargar
fr: Décharger
ja: アンロード
ko: 언로드
ru: Выгрузить
uk: Вивантажити
zh_hans: 卸载
zh_hk: 卸載

source: Unload Model
ar: تفريغ النموذج
de: Modell entladen
es: Descargar modelo
fr: Décharger le modèle
ja: モデルをアンロード
ko: 모델 언로드
ru: Выгрузить модель
uk: Вивантажити модель
zh_hans: 卸载模型
zh_hk: 卸載模型

source: Unload this model from memory.
ar: تفريغ هذا النموذج من الذاكرة.
de: Dieses Modell aus dem Speicher entladen.
es: Descargar este modelo de la memoria.
fr: Décharger ce modèle de la mémoire.
ja: このモデルをメモリからアンロードします。
ko: 이 모델을 메모리에서 해제합니다.
ru: Выгрузить эту модель из памяти.
uk: Вивантажити цю модель з пам'яті.
zh_hans: 从内存中卸载此模型。
zh_hk: 從記憶體中卸載此模型。

source: Update
ar: تحديث
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
ja: 更新
ko: 업데이트
ru: Обновить
uk: Оновити
zh_hans: 更新
zh_hk: 更新

source: Update Anyway
ar: تحديث على أي حال
de: Trotzdem aktualisieren
es: Actualizar de todos modos
fr: Mettre à jour quand même
ja: このまま更新
ko: 그대로 업데이트
ru: Обновить всё равно
uk: Оновити все одно
zh_hans: 仍然更新
zh_hk: 仍然更新

source: User message
ar: رسالة المستخدم
de: Nachricht des Benutzers
es: Mensaje del usuario
fr: Message de l'utilisateur
ja: ユーザーのメッセージ
ko: 사용자 메시지
ru: Сообщение пользователя
uk: Повідомлення користувача
zh_hans: 用户消息
zh_hk: 用戶訊息

source: Validation Error
ar: خطأ في التحقق
de: Validierungsfehler
es: Error de validación
fr: Erreur de validation
ja: バリデーションエラー
ko: 유효성 검사 오류
ru: Ошибка валидации
uk: Помилка валідації
zh_hans: 验证错误
zh_hk: 驗證錯誤

source: Version: %@
ar: الإصدار: %@
es: Versión: %@
ja: バージョン: %@
ko: 버전: %@
ru: Версия: %@
uk: Версія: %@
zh_hans: 版本：%@
zh_hk: 版本：%@

# Version: %@ (%@)
source: Version: %1$@ (%2$@)
ar: الإصدار: %1$@ (%2$@)
es: Versión: %1$@ (%2$@)
ja: バージョン: %1$@ (%2$@)
ko: 버전: %1$@ (%2$@)
ru: Версия: %1$@ (%2$@)
uk: Версія: %1$@ (%2$@)
zh_hans: 版本：%1$@ (%2$@)
zh_hk: 版本：%1$@ (%2$@)

source: View
ar: عرض
de: Ansicht
es: Visualización
fr: Présentation
ja: 表示
ko: 보기
ru: Вид
uk: Вигляд
zh_hans: 显示
zh_hk: 顯示

source: Vision
ar: رؤية
es: Visión
ja: ビジョン
ko: 비전
ru: Зрение
uk: Зір
zh_hans: 视觉
zh_hk: 視覺

source: VRAM Size: %@
ar: حجم VRAM: %@
de: VRAM-Größe: %@
es: Tamaño de VRAM: %@
fr: Taille de la VRAM : %@
ja: VRAMサイズ: %@
ko: VRAM 크기: %@
ru: Размер VRAM: %@
uk: Розмір VRAM: %@
zh_hans: VRAM 大小：%@
zh_hk: VRAM 大小：%@

source: Width
ar: العرض
de: Breite
es: Ancho
fr: Largeur
ja: 幅
ko: 너비
ru: Ширина
uk: Ширина
zh_hans: 宽度
zh_hk: 寬度

source: Works together with Top-k. A higher value like 0.95 will lead to more diverse text, while a lower value like 0.5 will generate more focused and stable text.
ar: يعمل مع Top-k. القيمة العالية مثل 0.95 تؤدي إلى نص أكثر تنوعاً، بينما القيمة المنخفضة مثل 0.5 تولد نصاً أكثر تركيزاً واستقراراً.
de: Arbeitet mit Top-k zusammen. Ein höherer Wert wie 0,95 führt zu vielfältigerem Text, während ein niedrigerer Wert wie 0,5 fokussierteren und stabileren Text erzeugt.
es: Funciona junto con Top-k. Un valor más alto como 0.95 resultará en un texto más diverso, mientras que un valor más bajo como 0.5 generará un texto más enfocado y estable.
fr: Fonctionne avec Top-k. Une valeur élevée comme 0,95 entraînera un texte plus diversifié, tandis qu'une valeur faible comme 0,5 générera un texte plus ciblé et stable.
ja: Top-kと連動し、0.95のような高い値では多様な文章が生成され、0.5のように低い値では焦点を絞った安定的な文章が生成されます。
ko: Top-k와 함께 작동합니다. 0.95와 같이 높은 값은 더 다양한 텍스트를 생성하고, 0.5와 같이 낮은 값은 더 집중되고 안정적인 텍스트를 생성합니다.
ru: Работает вместе с Top-k. Более высокое значение, например 0,95, приведет к более разнообразному тексту, а более низкое значение, например 0,5, создаст более сфокусированный и стабильный текст.
uk: Працює разом із Top-k. Вище значення, наприклад 0,95, призведе до різноманітнішого тексту, а нижче значення, наприклад 0,5, створить більш сфокусований і стабільний текст.
zh_hans: 与 Top-k 配合使用。较高的值（如 0.95）会产生更多样化的文本，而较低的值（如 0.5）会产生更集中且更稳定的文本。
zh_hk: 與 Top-k 配合使用。較高的值（如 0.95）會產生更多樣化的文本，而較低的值（如 0.5）會產生更集中且更穩定的文本。

source: You can also donate directly at PayPal.
ar: يمكنك أيضًا التبرع مباشرة عبر PayPal.
de: Sie können auch direkt über PayPal spenden.
es: También puedes donar directamente en PayPal.
fr: Vous pouvez également faire un don directement sur PayPal.
ja: PayPalで直接寄付していただくこともできます。
ko: PayPal을 통해 직접 후원하실 수도 있습니다.
ru: Вы также можете сделать пожертвование напрямую через PayPal.
uk: Ви також можете зробити пожертву прямо через PayPal.
zh_hans: 您也可以直接通过 PayPal 进行捐赠。
zh_hk: 您也可以直接透過 PayPal 進行捐助。

source: You can support me at Buy Me a Coffee from the price of a cup of green tea.
ar: يمكنك دعمي على Buy Me a Coffee بسعر كوب من الشاي الأخضر.
de: Sie können mich bei Buy Me a Coffee ab dem Preis einer Tasse grünen Tees unterstützen.
es: Puedes apoyarme en Buy Me a Coffee desde el precio de una taza de té verde.
fr: Vous pouvez me soutenir sur Buy Me a Coffee à partir du prix d'une tasse de thé vert.
ja: Buy Me a Coffeeで、緑茶一杯分の金額からサポートしていただけます。
ko: Buy Me a Coffee에서 녹차 한 잔 가격으로 개발자를 후원하실 수 있습니다.
ru: Вы можете поддержать меня на Buy Me a Coffee по цене чашки зеленого чая.
uk: Ви можете підтримати мене на Buy Me a Coffee за ціною чашки зеленого чаю.
zh_hans: 您可以在 Buy Me a Coffee 上支持我，金额仅需一杯绿茶的价格。
zh_hk: 您可以在 Buy Me a Coffee 上支持我，金額僅需一小杯綠茶的價格。

source: Zoom In
ar: تكبير
de: Vergrößern
es: Acercar
fr: Zoom avant
ja: 拡大
ko: 확대
ru: Увеличить
uk: Збільшити
zh_hans: 放大
zh_hk: 放大

source: Zoom Out
ar: تصغير
de: Verkleinern
es: Alejar
fr: Zoom arrière
ja: 縮小
ko: 축소
ru: Уменьшить
uk: Зменшити
zh_hans: 缩小
zh_hk: 縮小
